Revit 2027 API
ElectricalSetting.GetElectricalSettings Method
 Get the electrical settings of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElectricalSetting GetElectricalSettings(
	Document document
)
Public Shared Function GetElectricalSettings (
	document As Document
) As ElectricalSetting
public:
static ElectricalSetting^ GetElectricalSettings(
	Document^ document
)
static member GetElectricalSettings :
        document : Document -> ElectricalSetting
Parameters
document Document
 The document.
Return Value
ElectricalSetting
 The electrical settings of the project.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace